Autodesk.Revit.DB.CustomSubCategoryId
Since:
2025
An enumerated type listing pseudo sub-categories that can appear in a mapping template.
These types do not represent an independent category in Revit, but can be mapped to specific IFC
entity.
Since:
2025

Autodesk.Revit.DB.CustomSubCategoryId.Soffit
The custom id representing soffits.

Autodesk.Revit.DB.CustomSubCategoryId.Coreshaft
The custom id representing cores/shafts.

Autodesk.Revit.DB.CustomSubCategoryId.RetainingWall
The custom id representing retaining walls.

Autodesk.Revit.DB.CustomSubCategoryId.FoundationWall
The custom id representing foundation walls.

Autodesk.Revit.DB.CustomSubCategoryId.ExteriorWall
The custom id representing exterior walls.

Autodesk.Revit.DB.CustomSubCategoryId.InteriorWall
The custom id representing interior walls.

Autodesk.Revit.DB.CustomSubCategoryId.None
The default value for most Revit categories and subcategories.